apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c123_i2c.h
#define TIVA_I2CS8_OAR                 (TIVA_I2C8_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS8_CSR                 (TIVA_I2C8_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS8_DR                  (TIVA_I2C8_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS8_IMR                 (TIVA_I2C8_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS8_RIS                 (TIVA_I2C8_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS8_MIS                 (TIVA_I2C8_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS8_ICR                 (TIVA_I2C8_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS8_SOAR2               (TIVA_I2C8_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS8_ACKCTL              (TIVA_I2C8_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C Status and control */

#define TIVA_I2CSC8_PP                 (TIVA_I2C8_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC8_PC                 (TIVA_I2C8_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 5 */

#if TIVA_NI2C > 9

/* I2C9 Master */

#define TIVA_I2CM9_SA                  (TIVA_I2C9_BASE + TIVA_I2CM_SA_OFFSET)
#define TIVA_I2CM9_CS                  (TIVA_I2C9_BASE + TIVA_I2CM_CS_OFFSET)
#define TIVA_I2CM9_DR                  (TIVA_I2C9_BASE + TIVA_I2CM_DR_OFFSET)
#define TIVA_I2CM9_TPR                 (TIVA_I2C9_BASE + TIVA_I2CM_TPR_OFFSET)
#define TIVA_I2CM9_IMR                 (TIVA_I2C9_BASE + TIVA_I2CM_IMR_OFFSET)
#define TIVA_I2CM9_RIS                 (TIVA_I2C9_BASE + TIVA_I2CM_RIS_OFFSET)
#define TIVA_I2CM9_MIS                 (TIVA_I2C9_BASE + TIVA_I2CM_MIS_OFFSET)
#define TIVA_I2CM9_ICR                 (TIVA_I2C9_BASE + TIVA_I2CM_ICR_OFFSET)
#define TIVA_I2CM9_CR                  (TIVA_I2C9_BASE + TIVA_I2CM_CR_OFFSET)
#define TIVA_I2CM9_CLKOCNT             (TIVA_I2C9_BASE + TIVA_I2CM_CLKOCNT_OFFSET)
#define TIVA_I2CM9_BMON                (TIVA_I2C9_BASE + TIVA_I2CM_BMON_OFFSET)

#if defined(CONFIG_ARCH_CHIP_TM4C123GH6ZRB)
#  define TIVA_I2CM9_CR2               (TIVA_I2C9_BASE + TIVA_I2CM_CR2_OFFSET)
#endif

/* I2C9 Slave */

#define TIVA_I2CS9_OAR                 (TIVA_I2C9_BASE + TIVA_I2CS_OAR_OFFSET)
#define TIVA_I2CS9_CSR                 (TIVA_I2C9_BASE + TIVA_I2CS_CSR_OFFSET)
#define TIVA_I2CS9_DR                  (TIVA_I2C9_BASE + TIVA_I2CS_DR_OFFSET)
#define TIVA_I2CS9_IMR                 (TIVA_I2C9_BASE + TIVA_I2CS_IMR_OFFSET)
#define TIVA_I2CS9_RIS                 (TIVA_I2C9_BASE + TIVA_I2CS_RIS_OFFSET)
#define TIVA_I2CS9_MIS                 (TIVA_I2C9_BASE + TIVA_I2CS_MIS_OFFSET)
#define TIVA_I2CS9_ICR                 (TIVA_I2C9_BASE + TIVA_I2CS_ICR_OFFSET)
#define TIVA_I2CS9_SOAR2               (TIVA_I2C9_BASE + TIVA_I2CS_SOAR2_OFFSET)
#define TIVA_I2CS9_ACKCTL              (TIVA_I2C9_BASE + TIVA_I2CS_ACKCTL_OFFSET)

/* I2C Status and control */

#define TIVA_I2CSC9_PP                 (TIVA_I2C9_BASE + TIVA_I2CSC_PP_OFFSET)
#define TIVA_I2CSC9_PC                 (TIVA_I2C9_BASE + TIVA_I2CSC_PC_OFFSET)

#endif /* TIVA_NI2C > 5 */

/* I2C_Register Bit Definitions *****************************************************/

/* I2C Master Slave Address (I2CM_SA) */

#define I2CM_SA_RS                     (1 << 0)  /* Bit 0:  Receive/Send */
#define I2CM_SA_SA_SHIFT               1         /* Bits 7-1: I2C Slave Address */
#define I2CM_SA_SA_MASK                (0x7f << I2CM_SA_SA_SHIFT)

/* I2C Master Control/Status (I2CM_CS) */

#define I2CM_CS_BUSY                   (1 << 0)  /* Bit 0:  I2C Busy (read) */
#define I2CM_CS_ERROR                  (1 << 1)  /* Bit 1:  Error in last bus operation (read) */
#define I2CM_CS_ADRACK                 (1 << 2)  /* Bit 2:  Acknowledge Address (read) */
#define I2CM_CS_DATACK                 (1 << 3)  /* Bit 3:  Acknowledge Data (read) */
#define I2CM_CS_ARBLST                 (1 << 4)  /* Bit 4:  Arbitration Lost (read) */
#define I2CM_CS_IDLE                   (1 << 5)  /* Bit 5:  I2C Idle (read) */
#define I2CM_CS_BUSBSY                 (1 << 6)  /* Bit 6:  Bus Busy (read) */
#define I2CM_CS_CLKTO                  (1 << 7)  /* Bit 7:  Clock Timeout Error (read) */

#define I2CM_CS_RUN                    (1 << 0)  /* Bit 0:  I2C Master Enable (write) */
#define I2CM_CS_START                  (1 << 1)  /* Bit 1:  Generate START (write) */
#define I2CM_CS_STOP                   (1 << 2)  /* Bit 2:  Generate STOP (write) */
#define I2CM_CS_ACK                    (1 << 3)  /* Bit 3:  Data Acknowledge Enable (write) */
#define I2CM_CS_HS                     (1 << 4)  /* Bit 4:  High-Speed Enable (write) */

/* I2C Master Data (I2CM_DR) */

#define I2CM_DR_SHIFT                  (0)       /* Bits 7-0: Data transferred */
#define I2CM_DR_MASK                   (0xff << I2CM_DR_SHIFT)

/* I2C Master Timer Period (I2CM_TPR) */

#define I2CM_TPR_SHIFT                 (0)      /* Bits 6-0: SCL Clock Period */
#define I2CM_TPR_MASK                  (0x7f << I2CM_TPR_SHIFT)
#define I2CM_TPR_HS                    (1 << 7) /* Bit 7:  High-Speed Enable (write) */

#define I2CM_TPR_SHIFT                 (0)      /* Bits 7-0: SCL Clock Period */
#define I2CM_TPR_MASK                  (0xff << I2CM_TPR_SHIFT)

/* I2C Master Interrupt Mask (I2CM_IMR) */

#define I2CM_IMR_MIM                  (1 << 0)  /* Bit 0:  Master Interrupt Mask */
#define I2CM_IMR_CLKIM                (1 << 1)  /* Bit 1:  Clock Timeout Interrupt Mask */

/* I2C Master Raw Interrupt Status (I2CM_RIS) */

#define I2CM_RIS_MRIS                 (1 << 0)  /* Bit 0:  Master Raw Interrupt Status */
#define I2CM_RIS_CLKRIS               (1 << 1)  /* Bit 1:  Clock Timeout Raw Interrupt Status */

/* I2C Master Masked Interrupt Status (I2CM_MIS) */

#define I2CM_MIS_MMIS                 (1 << 0)  /* Bit 0:  Maseter Masked Interrupt Status */
#define I2CM_MIS_CLKMIS               (1 << 1)  /* Bit 1:  Clock Timeout Masked Interrupt Status */

/* I2C Master Masked Interrupt Status (I2CM_ICR) */

#define I2CM_ICR_MIC                  (1 << 0)  /* Bit 0:  Master Masked Interrupt Clear */
#define I2CM_ICR_CLKC                 (1 << 1)  /* Bit 1:  Clock Timeout Interrupt Clear */

