apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c123_i2c.h
/* I2C Master Configuration (I2CM_CR) */

#define I2CM_CR_LPBK                   (1 << 0)  /* Bit 0:: I2C Loopback */
#define I2CM_CR_MFE                    (1 << 4)  /* Bit 4:  I2C Master Function Enable */
#define I2CM_CR_SFE                    (1 << 5)  /* Bit 5:  I2C Slave Function Enable */

#if defined(CONFIG_ARCH_CHIP_TM4C123GH6ZRB)
#  define I2CM_CR_GFE                  (1 << 6)  /* Bit 6:  I2C Glitch Filter Enable */
#endif

/* I2C Master Clock Low Timeout Count */

#define I2CM_CLKOCNT_CNTL_SHIFT        (0)       /* Bits 7-0: I2C Master Count */
#define I2CM_CLKOCNT_CNTL_MASK         (0xff << I2CM_CLKOCNT_CNTL_SHIFT)

/* I2C Master Configuration */

#define I2CM_BMON_SCL                  (1 << 0)  /* Bit 0:  II2C SCL Status */
#define I2CM_BMON_SCA                  (1 << 1)  /* Bit 1:  II2C SDA Status */

/* I2C Master Configuration 2 */

#if defined(CONFIG_ARCH_CHIP_TM4C123GH6ZRB)
#  define I2CM_CR2_GFPW_SHIFT          (4)       /* I2C Glitch Filter Pulse Width */
#  define I2CM_CR2_GFPW_MASK           (7 << I2CM_CR2_GFPW_SHIFT)
#    define I2CM_CR2_GFPW_BYPASS       (0 << I2CM_CR2_GFPW_SHIFT) /* Bypass */
#    define I2CM_CR2_GFPW_1CLK         (1 << I2CM_CR2_GFPW_SHIFT) /* 1 clock */
#    define I2CM_CR2_GFPW_2CLKS        (2 << I2CM_CR2_GFPW_SHIFT) /* 2 clocks */
#    define I2CM_CR2_GFPW_3CLKS        (3 << I2CM_CR2_GFPW_SHIFT) /* 3 clocks */
#    define I2CM_CR2_GFPW_4CLKS        (4 << I2CM_CR2_GFPW_SHIFT) /* 4 clocks */
#    define I2CM_CR2_GFPW_8CLKS        (5 << I2CM_CR2_GFPW_SHIFT) /* 8 clocks */
#    define I2CM_CR2_GFPW_16CLKS       (6 << I2CM_CR2_GFPW_SHIFT) /* 16 clocks */
#    define I2CM_CR2_GFPW_31CLKS       (7 << I2CM_CR2_GFPW_SHIFT) /* 31 clocks */
#endif

/* I2C Slave Own Address (I2CS_OAR) */

#define I2CS_OAR_MASK                  0x7f      /* Bits 6-0: I2C Slave Own Address */

/* I2C Slave Control/Status (I2CS_CSR) */

#define I2CS_CSR_RREQ                  (1 << 0)  /* Bit 0:  Receive Request (read) */
#define I2CS_CSR_TREQ                  (1 << 1)  /* Bit 1:  Transmit Request (read) */
#define I2CS_CSR_FBR                   (1 << 2)  /* Bit 2:  First Byte Received (read) */
#define I2CS_CSR_OAR2SEL               (1 << 3)  /* Bit 3:  OAR2 Address Matched (read) */

#define I2CS_CSR_DA                    (1 << 0)  /* Bit 0:  Device Active (write) */

/* I2C Slave Data (I2CS_DR) */

#define I2CS_DR_SHIFT                  (0)       /* Bits 7-0: Data for Transfer */
#define I2CS_DR_MASK                   (0xff << I2CS_DR_SHIFT)

/* I2C Slave Interrupt Mask (I2CS_IMR) */

#define I2CS_IMR_DATAIM                (1 << 0)  /* Bit 0:  Data Interrupt Mask */
#define I2CS_IMR_STARTIM               (1 << 1)  /* Bit 1:  Start Condition Interrupt Mask */
#define I2CS_IMR_STOPIM                (1 << 2)  /* Bit 2:  Stop Condition Interrupt Mask */

/* I2C Slave Raw Interrupt Status (I2CS_RIS) */

#define I2CS_RIS_DATARIS               (1 << 0)  /* Bit 0:  Data Raw Interrupt Status */
#define I2CS_RIS_STARTRIS              (1 << 1)  /* Bit 1:  Start Condition Raw Interrupt Status */
#define I2CS_RIS_STOPRIS               (1 << 2)  /* Bit 2:  Stop Condition Raw Interrupt Status */

/* I2C Slave Masked Interrupt Status (I2CS_MIS) */

#define I2CS_MIS_DATAMIS               (1 << 0)  /* Bit 0:  Data Masked Interrupt Status */
#define I2CS_MIS_STARTMIS              (1 << 1)  /* Bit 1:  Start Condition Masked Interrupt Status */
#define I2CS_MIS_STOPMIS               (1 << 2)  /* Bit 2:  Stop Condition Masked Interrupt Status */

/* I2C Slave Interrupt Clear (I2CS_ICR) */

#define I2CS_ICR_DATAIC                (1 << 0)  /* Bit 0:  Data Interrupt Clear */
#define I2CS_ICR_STARTIC               (1 << 1)  /* Bit 1:  Start Condition Interrupt Clear */
#define I2CS_ICR_STOPIC                (1 << 2)  /* Bit 2:  Stop Condition Interrupt Clear */

/* I2C Slave Own Address 2 */

#define I2CS_SOAR2_SHIFT               (0)       /* Bits 0-6: I2C Slave Own Address 2 */
#define I2CS_SOAR2_MASK                (0x7f << I2CS_SOAR2_SHIFT)
#define I2CS_SOAR2_OAR2EN              (1 << 7)  /* Bit 7:  I2C Slave Own Address 2 Enable */

/* I2C Slave ACK Control */

#define I2CS_ACKCTL_ACKOEN             (1 << 0)  /* Bit 0:  I2C Slave ACK Override Enable */
#define I2CS_ACKCTL_ACKOVAL            (1 << 1)  /* Bit 1:  I2C Slave ACK Override Value */

/* I2C Peripheral Properties */

#define I2CSC_PP_HS                    (1 << 0)  /* Bit 0:  High-Speed Capable */

/* I2C Peripheral Configuration */

#define I2CSC_PC_HS                    (1 << 0)  /* Bit 0:  High-Speed Capable */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C123_I2C_H */
